espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_eusart.c
  while (!(eusart->STATUS & EUSART_STATUS_RXFL)) {
  }   // Wait for incoming data.

  for (uint8_t index = 0; index < dali_rx_nb_packets[EUSART_NUM(eusart)]; index++) {
    // when DALICFG.DALIEN is set to 1, then all 16 bits [15:0] represent data
    // When receiving a frame that has more than 16 databits,
    // RXDATA register needs to be read twice:
    //    First read will provide 16 LSBs of the received frame.
    //    Second read will provide the remaining RX frame bits.
    data |= ((eusart->RXDATA & _EUSART_RXDATA_RXDATA_MASK) << (index * 16));
  }
  return data;
}

#endif /* EUSART_DALICFG_DALIEN */
#endif /* EUSART_PRESENT */

/***************************************************************************//**
 * Configures the baudrate (or as close as possible to a specified baudrate)
 * depending on the current mode of the EU(S)ART peripheral.
 *
 * @note (1) When the oversampling is disabled, the peripheral clock frequency
 *           must be at least three times higher than the chosen baud rate.
 ******************************************************************************/
void EUSART_BaudrateSet(EUSART_TypeDef *eusart,
                        uint32_t refFreq,
                        uint32_t baudrate)
{
  uint32_t          clkdiv;
  uint8_t           oversample = 0;

  // Prevent dividing by 0.
  EFM_ASSERT(baudrate);

  // Make sure the module exists on the selected chip.
  EFM_ASSERT(EUSART_REF_VALID(eusart));

  // Get the current frequency.
  if (!refFreq) {
    refFreq = CMU_ClockFreqGet(EUSART_ClockGet(eusart));
  }

#if defined(EUSART_PRESENT)
  // In synchronous mode (ex: SPI)
  if (eusart->CFG0 & _EUSART_CFG0_SYNC_MASK ) {
    EFM_ASSERT(baudrate <= refFreq);

    EUSART_Enable_TypeDef txrxEnStatus = eusartDisable;
    bool wasEnabled = (eusart->EN & _EUSART_EN_EN_MASK) == true;
    clkdiv = refFreq / baudrate - 1UL;

    // If the desired bit rate requires a divider larger than the Synchronous divider bitfield (CFG2_SDIV),
    // the resulting spi master bus clock will be undefined because the result will be truncated.
    EFM_ASSERT(clkdiv <= (_EUSART_CFG2_SDIV_MASK >> _EUSART_CFG2_SDIV_SHIFT));

    if (wasEnabled) {
      eusart_sync(eusart, _EUSART_SYNCBUSY_RXEN_MASK | _EUSART_SYNCBUSY_TXEN_MASK);

      // Save the state of the reveiver and transmitter before disabling the peripheral.
      if (eusart->STATUS & (_EUSART_STATUS_RXENS_MASK | _EUSART_STATUS_TXENS_MASK)) {
        txrxEnStatus = eusartEnable;
      } else if (eusart->STATUS & (_EUSART_STATUS_RXENS_MASK)) {
        txrxEnStatus = eusartEnableRx;
      } else if (eusart->STATUS & (_EUSART_STATUS_TXENS_MASK)) {
        txrxEnStatus = eusartEnableTx;
      } else {
        EFM_ASSERT(false);
      }

      // Disable the eusart to be able to modify the CFG2 register.
      EUSART_Disable(eusart);
    }

    // In Synchronous mode the clock divider that is managing the bitRate
    // is located inside the sdiv bitfield of the CFG2 register instead of
    // the CLKDIV register combined with the oversample setting for asynchronous mode.
    eusart->CFG2 = (eusart->CFG2 & ~(_EUSART_CFG2_SDIV_MASK)) | ((clkdiv << _EUSART_CFG2_SDIV_SHIFT) & _EUSART_CFG2_SDIV_MASK);

    if (wasEnabled) {
      EUSART_Enable(eusart, txrxEnStatus);
    }
  } else // In asynchronous mode (ex: UART)
#endif
  {
    // The peripheral must be enabled to configure the baud rate.
    EFM_ASSERT(eusart->EN == EUSART_EN_EN);

#if defined(EUSART_DALICFG_DALIEN)
    if (eusart->DALICFG & EUSART_DALICFG_DALIEN) {
      // adjust for manchester double-clocking scheme
      baudrate *= 2;
    }
#endif

    /*
     * Use integer division to avoid forcing in float division
     * utils, and yet keep rounding effect errors to a minimum.
     *
     * CLKDIV is given by:
     *
     * CLKDIV = 256 * (fUARTn/(oversample * br) - 1)
     * or
     * CLKDIV = (256 * fUARTn)/(oversample * br) - 256
     *
     * Since fUARTn may be derived from HFCORECLK, consider the overflow when
     * using integer arithmetic.
     *
     * The basic problem with integer division in the above formula is that
     * the dividend (256 * fUARTn) may become higher than the maximum 32 bit
     * integer. Yet, the dividend should be evaluated first before dividing
     * to get as small rounding effects as possible.
     * Also, harsh restrictions on the maximum fUARTn value should not be made.
     *
     * Since the last 3 bits of CLKDIV are don't care, base the
     * integer arithmetic on the below formula:
     *
     * CLKDIV/8 = ((32*fUARTn)/(br * Oversample)) - 32
     *
     * and calculate 1/8 of CLKDIV first. This allows for fUARTn
     * up to 128 MHz without overflowing a 32 bit value.
     */

    // Map oversampling.
    switch (eusart->CFG0 & _EUSART_CFG0_OVS_MASK) {
      case eusartOVS16:
        EFM_ASSERT(baudrate <= (refFreq / 16));
        oversample = 16;
        break;

      case eusartOVS8:
        EFM_ASSERT(baudrate <= (refFreq / 8));
        oversample = 8;
        break;

      case eusartOVS6:
        EFM_ASSERT(baudrate <= (refFreq / 6));
        oversample = 6;
        break;

      case eusartOVS4:
        EFM_ASSERT(baudrate <= (refFreq / 4));
        oversample = 4;
        break;

      case eusartOVS0:
        EFM_ASSERT(refFreq >= (3 * baudrate)); // See Note #1.
        oversample = 1;
        break;

      default:
        // Invalid input
        EFM_ASSERT(0);
        break;
    }

    if (oversample > 0U) {
      // Calculate and set the CLKDIV with fractional bits.
      clkdiv  = (32 * refFreq) / (baudrate * oversample);
      clkdiv -= 32;
      clkdiv *= 8;

      // Verify that the resulting clock divider is within limits.
      EFM_ASSERT(clkdiv <= _EUSART_CLKDIV_MASK);

      // If the EFM_ASSERT is not enabled, make sure not to write to reserved bits.
      clkdiv &= _EUSART_CLKDIV_MASK;

      eusart_sync(eusart, _EUSART_SYNCBUSY_DIV_MASK);
      eusart->CLKDIV = clkdiv;
      eusart_sync(eusart, _EUSART_SYNCBUSY_DIV_MASK);
    }
  }
}

/***************************************************************************//**
 * Gets the current baudrate.
 ******************************************************************************/
uint32_t EUSART_BaudrateGet(EUSART_TypeDef *eusart)
{
  uint32_t freq;
  uint32_t div = 1;
  uint32_t br = 0;
  EUSART_OVS_TypeDef ovs = eusartOVS0;

  // Make sure the module exists on the selected chip.
  EFM_ASSERT(EUSART_REF_VALID(eusart));

